[
  {
    "word": "BIOS Basic Input/Output System (базова система вводу/виводу)",
    "description": "Набір підпрограм, що працюють безпосередньо з апаратними засобами комп’ютера і забезпечують передачу інформації між окремими елементами системи — пам’яттю, дисковими пристроями, відеоадаптером і т. п."
  },
  {
    "word": "Boot sector — завантажувальний сектор",
    "description": "Перший сектор на логічному диску, що містить код, необхідний для завантаження даних з цього диску, а також специфічну інформацію і рядки повідомлень про помилки."
  },
  {
    "word": "Browser (браузер)",
    "description": "Клієнтське програмне забезпечення для навігації та доступу до інформації в Інтернеті. Браузер інтерпретує HTML-код і відображає інформацію на дисплеї."
  },
  {
    "word": "Bus (шина)",
    "description": "Набір апаратних каналів передачі даних між компонентами комп’ютерної системи."
  },
  {
    "word": "Cluster (кластер)",
    "description": "Певна кількість секторів, які згруповані командою format. Кластер є мінімальною одиницею дискового простору, що виділяється файлу при його запису на диск."
  },
  {
    "word": "Codec (кодек)",
    "description": "Технологія компресії/декомпресії даних, вживана при обробці оцифрованого відео і стереозвуку."
  },
  {
    "word": "Cookie (файл «cookie»)",
    "description": "Невеликі текстові файли, які зберігаються в браузері комп’ютера або мобільного телефону після відвідування веб-сайтів. Використовуються для підтримки роботи веб-сайтів і надання інформації власникам сайту, зокрема про уподобання користувачів."
  },
  {
    "word": "FAT file system — файлова система FAT",
    "description": "Файлова система, заснована на таблиці розміщення файлів (File Allocation Table, FAT), яка дозволяє відслідковувати стан різних ділянок дискового простору."
  },
  {
    "word": "FAT32",
    "description": "Удосконалена файлова система FAT, яка підтримує великі жорсткі диски і більш ефективно використовує дисковий простір."
  },
  {
    "word": "Internet Protocol (IP)",
    "description": "Частина TCP/IP, що відповідає за адресацію і відправку TCP-пакетів по мережі."
  },
  {
    "word": "Internet Protocol Control Protocol (IPCP)",
    "description": "Протокол, що використовується для налаштування, включення або відключення модулів IP на обох сторонах каналу."
  },
  {
    "word": "Password — пароль",
    "description": "Унікальний рядок символів, необхідний при реєстрації або спробі доступу до захищених ресурсів чи сервісів."
  },
  {
    "word": "Protocol — протокол",
    "description": "Набір правил і угод, за якими два комп’ютери обмінюються повідомленнями по мережі. Програмне забезпечення реалізує багаторівневу структуру протоколів, де кожен рівень базується на попередньому. У Windows використовуються NetBEUI, TCP/IP і IPX/SPX-сумісні протоколи."
  },
  {
    "word": "USB. Universal Serial Bus",
    "description": "Двосторонній послідовний інтерфейс, що дозволяє динамічно підключати до комп’ютера периферійні пристрої (контролери, сканери, клавіатури тощо)."
  },
  {
    "word": "Абсолютна адреса (absolute address, physical address)",
    "description": "Цифровий код, що однозначно ідентифікує байт, комірку пам’яті або пристрій. Може бути незмінною або обчислюватися з логічної адреси, не уточнюється програмно."
  },
  {
    "word": "Адреса",
    "description": "Номер байта в оперативній або іншій пам’яті комп’ютера. Адреса змінної — це адреса першого байта ділянки пам’яті, яку вона займає."
  },
  {
    "word": "Активізація (activation)",
    "description": "Приведення об’єкта в стан готовності до дії. Наприклад, активізація меню чи кнопок дозволяє користувачеві почати взаємодію з системою."
  },
  {
    "word": "Активна програма (active program)",
    "description": "Програма, якій передано управління центральним процесором."
  },
  {
    "word": "Активний файл (active file)",
    "description": "Відкритий файл, з яким наразі працює система."
  },
  {
    "word": "Алгоритм",
    "description": "Чітко визначена послідовність кроків для розв’язання завдання."
  },
  {
    "word": "Адміністратори",
    "description": "Користувачі з найвищим рівнем доступу на форумі. Можуть змінювати налаштування, керувати користувачами, призначати модераторів тощо."
  },
  {
    "word": "Алфавіт",
    "description": "Фіксований набір символів для певної мови, з яких складається текст. Інші символи не допускаються."
  },
  {
    "word": "Анімація",
    "description": "Мультимедійна технологія, що створює ефект руху зображення шляхом відтворення послідовності кадрів з частотою понад 16 кадрів/сек."
  },
  {
    "word": "Аргумент",
    "description": "Параметр (константа, змінна або вираз), який передається функції, процедурі або методу. Визначає значення або об’єкт, що використовується під час виклику."
  },
  {
    "word": "Арифметико-логічний пристрій (АЛП)",
    "description": "Частина процесора, що виконує арифметичні та логічні операції."
  },
  {
    "word": "Архітектура комп’ютера",
    "description": "Логічна організація, структура та ресурси комп’ютера. Визначає принципи роботи та взаємозв’язки між основними вузлами."
  },
  {
    "word": "Архіватор",
    "description": "Програма для упакування одного або кількох файлів в архів, а також для їх розпакування з метою збереження або переносу."
  },
  {
    "word": "Архітектура фон Неймана",
    "description": "Архітектура комп’ютера, що має один арифметико-логічний пристрій, через який проходить потік даних, і один пристрій управління, через який проходить потік команд."
  },
  {
    "word": "Атрибут (attribute)",
    "description": "Ознака або властивість, що характеризує об’єкт. Наприклад, атрибутами символів на екрані є шрифт, колір, розмір тощо."
  },
  {
    "word": "База даних",
    "description": "Один або кілька файлів, призначених для зберігання, зміни й обробки великих обсягів взаємозалежної інформації."
  },
  {
    "word": "База знань (knowledge base)",
    "description": "Сукупність знань, що стосуються певної предметної сфери і формально представлені для здійснення логічних тверджень."
  },
  {
    "word": "Байт (byte)",
    "description": "Фрагмент двійкового коду з 8 бітів. Одиниця виміру інформації, яку комп’ютер обробляє як одне ціле. 1 байт = 8 біт."
  },
  {
    "word": "Бібліотека підпрограм",
    "description": "Файл, що містить стандартні підпрограми, складені на одній мові програмування і мають узгоджену структуру входів і виходів."
  },
  {
    "word": "Блок програми, програмний блок (program block)",
    "description": "Відносно незалежний фрагмент програми, обмежений спеціальними символами. Може містити опис змінних, процедур, функцій та вкладених блоків."
  },
  {
    "word": "Блокова структура програми (program block structure)",
    "description": "Організація програми у вигляді послідовності суміжних або вкладених блоків, що дозволяє економити оперативну пам’ять."
  },
  {
    "word": "Блок-схема",
    "description": "Графічна форма вираження алгоритмів, де послідовність дій задається стрілками."
  },
  {
    "word": "Буфер",
    "description": "Спеціальна ділянка пам’яті, що зменшує кількість фізичних обмінів даними між програмою та зовнішніми носіями."
  },
  {
    "word": "Вбудована процедура (built-in procedure)",
    "description": "Стандартна процедура, визначена мовою програмування, наприклад Read, Write у Паскалі. Не потребує опису в програмі та автоматично розпізнається транслятором."
  },
  {
    "word": "Вбудована функція (built-in function)",
    "description": "Стандартна функція, реалізація якої забезпечується системою програмування. Наприклад, математичні функції cos, sin, exp. Їхнє застосування не потребує опису в програмі, оскільки виклик автоматично розпізнається транслятором."
  },
  {
    "word": "Введення даних (data input)",
    "description": "Процес запису даних у пам’ять комп’ютера за допомогою пристрою введення або передача даних із зовнішнього запам’ятовувального пристрою в оперативну пам’ять."
  },
  {
    "word": "Величина (дані)",
    "description": "Об’єкт, із яким асоціюється множина значень. У програмуванні — це дані, яким потрібно виділити пам’ять. Розрізняють константи (незмінні) і змінні (змінюються під час виконання)."
  },
  {
    "word": "Виведення даних (data output)",
    "description": "Процес передачі даних з основної пам’яті комп’ютера на екран, папір, зовнішні носії або запам’ятовувальні пристрої."
  },
  {
    "word": "Виконання програми (program run)",
    "description": "Робота комп’ютера за заданою програмою."
  },
  {
    "word": "Випадкове число",
    "description": "Число, вибране довільно з певного діапазону."
  },
  {
    "word": "Вираз (expression)",
    "description": "Запис правила для обчислення значення, що складається з констант, змінних, функцій і операцій. Може бути арифметичним, логічним тощо, залежно від мови програмування."
  },
  {
    "word": "Вихідні дані (output data)",
    "description": "Дані, що надходять із комп’ютера на пристрої виведення після виконання програми."
  },
  {
    "word": "Відношення",
    "description": "Операція порівняння, позначена знаками =, <>, <=, >, >=."
  },
  {
    "word": "Віртуальна пам’ять (virtual memory)",
    "description": "Механізм управління пам’яттю, що дозволяє програмі використовувати більше пам’яті, ніж реально доступно. Включає апаратні та програмні засоби керування пам’яттю."
  },
  {
    "word": "Вкладений цикл",
    "description": "Цикл, що міститься всередині іншого циклу."
  },
  {
    "word": "Властивості алгоритмів",
    "description": "Основні характеристики алгоритмів: визначеність, дискретність, масовість, результативність, зрозумілість."
  },
  {
    "word": "Вхідні дані (input data)",
    "description": "Дані, що вводяться в обчислювальну систему через пристрої введення."
  },
  {
    "word": "Графічний редактор",
    "description": "Програма або комплекс програм для створення й редагування зображень на екрані комп’ютера. Дозволяє малювати, розфарбовувати, створювати написи, обробляти скановані зображення та працювати з тривимірними об’єктами."
  },
  {
    "word": "Дефрагментація",
    "description": "Оптимізація дискового простору шляхом упорядкування кластерів, які належать одному файлу."
  },
  {
    "word": "Динамічна змінна",
    "description": "Змінна, пам’ять для якої виділяється під час виконання програми. Не має імені, доступна лише через вказівник."
  },
  {
    "word": "Динамічна пам’ять",
    "description": "Спосіб розподілу оперативної пам’яті між завданнями під час виконання програми."
  },
  {
    "word": "Дискретність алгоритму",
    "description": "Властивість алгоритму, що дозволяє розділити процес на окремі елементарні кроки."
  },
  {
    "word": "Дійсне число",
    "description": "Тип даних, що містить числа з десятковою крапкою або десятковим порядком."
  },
  {
    "word": "Драйвери",
    "description": "Програми, що розширюють можливості операційної системи для управління пристроями введення-виведення, пам’яттю тощо."
  },
  {
    "word": "Екземпляр класу (class instance)",
    "description": "Конкретний об’єкт, створений конструктором класу в об’єктно-орієнтованому програмуванні. Має власні властивості та методи."
  },
  {
    "word": "Завантаження",
    "description": "Запис програми в оперативну пам’ять за допомогою завантажника, що входить до складу операційної системи."
  },
  {
    "word": "Завантаження програми (program loading)",
    "description": "Зчитування програми з зовнішнього носія в оперативну пам’ять, налаштування адрес і запуск під управлінням завантажника."
  },
  {
    "word": "Задача",
    "description": "Питання або вимога виконати певну дію — обчислити, намалювати тощо."
  },
  {
    "word": "Запис",
    "description": "Структурований набір неоднорідних елементів (полів), кожне з яких має ім’я та тип. Розглядається як єдине ціле."
  },
  {
    "word": "Змінна (variable)",
    "description": "Елемент даних у програмі, якому привласнене ім’я. Змінні можуть приймати різні значення, змінюватися під час виконання програми та мають певний тип даних. Це область пам’яті, у якій зберігаються дані, якими оперує програма."
  },
  {
    "word": "Зовнішня пам’ять (backing storage, external memory)",
    "description": "Пам’ять, до якої можна звернутися лише через операції введення-виведення. Реалізується зовнішніми запам’ятовувальними пристроями для тривалого зберігання даних. Центральний процесор не має прямого доступу до неї."
  },
  {
    "word": "Інсталяція",
    "description": "Процес установки програмного забезпечення на комп’ютер користувача за допомогою пакетного менеджера або вбудованого засобу установки."
  },
  {
    "word": "Інтерфейс",
    "description": "Прості та зручні засоби взаємозв’язку між користувачем і програмою."
  },
  {
    "word": "Інформаційна модель",
    "description": "Модель, що описує інформаційні процеси або містить дані про властивості й стан об’єктів, процесів, явищ."
  },
  {
    "word": "Комп’ютерна модель",
    "description": "Модель, реалізована за допомогою програмних засобів."
  },
  {
    "word": "Комп’ютерна мережа",
    "description": "Сукупність комп’ютерів і периферійного обладнання, об’єднаних каналами передачі даних."
  },
  {
    "word": "Криптографія",
    "description": "Наука про способи перетворення інформації (шифрування) з метою її захисту."
  },
  {
    "word": "Обчислювальна мережа",
    "description": "Складний комплекс взаємозалежних програмних і апаратних компонентів, що узгоджено функціонують."
  },
  {
    "word": "Об’єкт (object)",
    "description": "У загальному значенні — предмет або явище, що існують у реальності, мають чіткі межі та визначену поведінку. У програмуванні — це програмний модуль, який об’єднує дані (властивості) та операції над ними (методи), має властивості інкапсуляції, успадкування, поліморфізму, та взаємодіє з іншими об’єктами через повідомлення."
  },
  {
    "word": "Онлайн (online)",
    "description": "Інтерактивний режим роботи в мережі, що передбачає двосторонній обмін даними між користувачем і системою. Також означає постійне підключення пристрою або користувача до мережі."
  },
  {
    "word": "Операційна система (operating system, OS)",
    "description": "Сукупність системних програм, що забезпечують середовище для виконання програм, керують апаратними ресурсами, пам’яттю, вводом-виводом, файловою системою, процесами та забезпечують захист даних."
  },
  {
    "word": "Полігон (polygon)",
    "description": "Багатозначний термін: математичний багатокутник, ділянка для випробувань, майданчик для будівництва, просторовий об’єкт у ГІС, елемент 3D-графіки. У графіці — примітив для побудови 3D-сцен, часто трикутник."
  },
  {
    "word": "Порт (port)",
    "description": "Абстракція для з’єднань у мережі, фізичний рознім для підключення пристроїв, адреса пам’яті для обміну даними, або канал для з’єднання пристроїв. Наприклад, порт 80 для HTTP, або ігровий порт для джойстика."
  },
  {
    "word": "Програма",
    "description": "План дій, який виконується певним виконавцем — комп’ютером або іншим пристроєм."
  },
  {
    "word": "Програмування",
    "description": "Процес розробки програм для обчислювальних і керуючих пристроїв."
  },
  {
    "word": "Програміст",
    "description": "Фахівець, який створює комп’ютерні програми та володіє знаннями в галузі програмування."
  },
  {
    "word": "Протокол передачі даних (protocol)",
    "description": "Набір правил, що регулюють обмін інформацією між комп’ютерами та програмами. Існують різні протоколи для різних рівнів зв’язку — від апаратного до прикладного."
  },
  {
    "word": "Прототип [дослідний зразок] (prototype)",
    "description": "Первинна або повна версія програмної системи, що використовується для демонстрації концепцій, перевірки вимог, оцінки працездатності, зниження ризиків, підтвердження функціональності та інших цілей. Служить моделлю для подальшої розробки або завершення продукту."
  },
  {
    "word": "Прототипування (prototyping)",
    "description": "Процес створення початкової версії програмної системи."
  },
  {
    "word": "Модель",
    "description": "Сукупність найважливіших властивостей об’єкта, процесу або явища, що визначається метою її створення і може мати різні форми вираження."
  },
  {
    "word": "Моделювання",
    "description": "Процес створення та дослідження моделі."
  },
  {
    "word": "Матеріальна модель",
    "description": "Фізично існуюча модель, яку можна побачити та потримати в руках."
  },
  {
    "word": "Макрос",
    "description": "Записана під певним іменем послідовність дій або команд, яку можна викликати з меню, кнопки чи комбінації клавіш. Зазвичай записується мовою Visual Basic for Applications."
  },
  {
    "word": "Нематеріальна модель",
    "description": "Модель, що описує властивості оригінала у вигляді сукупності інформації."
  },
  {
    "word": "Штучний інтелект (ШІ)",
    "description": "Дисципліна, що досліджує створення програм для вирішення завдань, які потребують інтелектуальних зусиль. Застосовується в іграх, навчанні, обробці природної мови, плануванні, доведенні теорем, візуальному сприйнятті тощо."
  }
]
