[
  {
    "word": "Соціальна ізоляція",
    "description": "Людина або навіть невелика група більше не є активною частиною \"основного\" суспільства; вони живуть на узбіччі суспільства\".\n\"<br>У кожній громаді є групи людей - часто приховані - які не можуть користуватися загальними благами, доступними для \"основного\" суспільства... Коли хтось є частиною суспільства, між ним і цим суспільством існує зв'язок. У випадку соціальної ізоляції цей зв'язок розривається.\n"
  },
  {
    "word": "Вразливі групи",
    "description": "До таких вразливих груп можуть належати: жінки та дівчата, люди похилого віку, люди, які живуть з ВІЛ/СНІДом або мають інвалідність, люди конкретної (\"нетрадиційної\") сексуальної орієнтації та представники меншин. Вразливі групи дуже вразливі до дискримінації, відчуження та насильства."
  },
  {
    "word": "Соціальна інклюзія",
    "description": "На противагу соціальній ізоляції існує соціальна інклюзія - процес, спрямований на зміцнення зв'язку людей зі своїм суспільством та його членами, а особливо на відновлення цього зв'язку, коли він ослаблений або розірваний."
  },
  {
    "word": "Розмаїття",
    "description": "На індивідуальному рівні, як агенти змін у поведінці, ми маємо унікальну можливість подавати приклад, бути чутливими до потреб інших, незалежно від того, чи є вони частиною \"основного\" суспільства, чи меншиною, а також бути лідерами у просуванні інклюзії ізольованих груп."
  },
  {
    "word": "Економічна ізоляція",
    "description": "Люди, які не мають достатньо коштів для задоволення потреб, що вважаються \"нормальними\" в суспільстві)"
  },
  {
    "word": "Правова ізоляція",
    "description": "Приклад: люди, такі як мігранти, які не мають правового статусу"
  },
  {
    "word": "Фізична ізоляція",
    "description": "Приклад: люди з обмеженими можливостями , які фізично не можуть брати участь у житті \"основного\" суспільства."
  },
  {
    "word": "Інституційна ізоляція",
    "description": "Приклад: люди, які перебувають у в'язниці або таборах для біженців."
  },
  {
    "word": "Насилля",
    "description": "Застосування сили або влади, у вигляді дії, або бездіяльності в будь-якій обстановці, погрози, уявної, або реальної по відношенню до себе, іншої особи, групи, спільноти, що призводить або з великою ймовірністю може призвести до смерті, фізичної травми, психологічної або емоційної шкоди, відставання в розвитку або позбавлення прав."
  },
  {
    "word": "Самоспрямоване насильство",
    "description": "Насильство над собою, включаючи самогубство та зловживання психоактивними речовинами або зловживання наркотиками."
  },
  {
    "word": "Міжособистісне насильство",
    "description": "Насильство, що відбувається між людьми, які можуть бути або не бути знайомі один з одним, включаючи жорстоке поводження з дітьми, знущання, домашнє або сімейне насильство, насильство над людьми похилого віку, а також (на рівні громади) бандитське насильство , насильство з боку вболівальників спортивних команд, напади натовпу, насильство над маргіналізованими групами і т.д."
  },
  {
    "word": "Колективне насильство",
    "description": "Насильство під час війни, тероризму, геноциду тощо."
  },
  {
    "word": "Попередження насильства",
    "description": "Означає уникнення насильства в першу чергу."
  },
  {
    "word": "Пом'якшення наслідків насильства",
    "description": "Зосереджується на зниженні подальшого ризику насильства та зменшенні його наслідків, коли воно вже сталося."
  },
  {
    "word": "Реагування на насильство",
    "description": "Означає дії або втручання, спрямовані на подолання насильства після того, як воно сталося."
  },
  {
    "word": "Культура ненасильства та миру",
    "description": "\"Йдеться про залучення до процесу, в якому кожну людину поважають, цінують і дають їй можливість брати участь, шукати разом, не боячись насильства, конструктивні і стійкі рішення проблем, напруженості і насильства.\".<br>\"Культура ненасильства 'поважає людину, її добробут і самобутність; вона шанує різноманітність, недискримінацію, інклюзивність, взаєморозуміння і діалог, готовність служити, співпрацю і тривалий мир. Це культура, в якій окремі особи, інституції та суспільства утримуються від заподіяння шкоди іншим, групам, громадам чи самим собі. Існує прихильність до позитивних і конструктивних рішень проблем, напруженості та джерел насильства; насильство ніколи не є варіантом'.\""
  },
  {
    "word": "Персональна стійкість",
    "description": "\"Здатність людини справлятися з несприятливими обставинами ('диференційованими труднощами') і стихійними лихами. Крім того, це здатність долати негаразди, позитивно адаптуючись до них і перетворюючи їх на можливості для зростання.\" Також: \"Здатність адаптуватися і розвиватися."
  },
  {
    "word": "Стійкість",
    "description": "Це використання людської вразливості на користь власного зростання."
  },
  {
    "word": "Напористість",
    "description": "Вміння замість того, щоб уникати складних ситуацій чи переживати їх, рішучість і активність у вирішенні таких проблем дозволяє нам не сприймати себе як жертву, а навпаки, взяти ситуацію під свій контроль, наскільки це можливо. Отже, коли ситуація виходить з-під нашого контролю, ми залишаємося зосередженими \"на загальній картині."
  },
  {
    "word": "Життєстійкі люди",
    "description": "Відчувають як 'позитивні', так і 'негативні' емоції, причому з такою ж інтенсивністю, як і всі інші"
  },
  {
    "word": "Внутрішні ресурси",
    "description": "Наші сильні сторони та здібності"
  },
  {
    "word": "Зовнішні ресурси",
    "description": "Наприклад: \"Підтримка сім'ї та друзів\""
  },
  {
    "word": "Самовираження через творчість",
    "description": "Можливість самовираження - це ключ до зміцнення нашої особистої стійкості. Мистецтво, спорт, музика, танці та відео є дуже корисними інструментами самовираження, особливо для дітей та молоді. Ці творчі інструменти допомагають нам висловити болючий досвід і описати, як він вплинув на нас, і можуть зробити значний внесок у подолання пережитої травми"
  },
  {
    "word": "Культивування самопізнання та самоусвідомлення",
    "description": "Роздуми про минулий досвід, щоб визначити наші власні 'больові точки', знання наших слабких і сильних сторін, розуміння того, як ми реагуємо на різні ситуації і чому, а також з'ясування того, що 'заряджає наші батарейки' і що допомагає нам підтримувати рівень енергії, справлятися зі стресом і розслаблятися, особливо за складних обставин"
  },
  {
    "word": "Перемовини в умовах співпраці",
    "description": "Роздуми про минулий досвід, щоб визначити наші власні 'больові точки', знання наших слабких і сильних сторін, розуміння того, як ми реагуємо на різні ситуації і чому, а також з'ясування того, що 'заряджає наші батарейки' і що допомагає нам підтримувати рівень енергії, справлятися зі стресом і розслаблятися, особливо за складних обставин"
  },
  {
    "word": "Перемовини в умовах співпраці",
    "description": "Це конструктивні перемовини, де взаємовідносини вважаються такими ж важливими і цінними, як і результат перемовин. При спільному підході сторони прагнуть знайти найкраще рішення для обох, а не найкраще для себе за рахунок іншої сторони. Результат досягається консенсусом і залишає обидві сторони щасливими або задоволеними, оскільки задовольняє (деякі) їхні потреби"
  },
  {
    "word": "Медіація",
    "description": "Це добровільний процес вирішення спорів або розбіжностей між сторонами, в якому нейтральна третя сторона - медіатор - втручається, щоб допомогти їм досягти згоди, причому за мінімального сприяння, оскільки сторони самі беруть на себе ініціативу."
  },
  {
    "word": "Консенсус",
    "description": "Це означає, що всі підтримують результати. (У контексті перемовин в умовах співпраці)."
  },
  {
    "word": "Конкурентні перемовини",
    "description": "Це пошук рішення з максимальним виграшем (для нас) і мінімальним програшем (для іншого), іншими словами, найкращої для себе угоди."
  },
  {
    "word": "Медіатор",
    "description": "Сприяє, тобто дає можливість сторонам самостійно шукати та досягати згоди, створюючи сприятливе середовище для досягнення консенсусу. У процесі медіації ключовими рушіями є самі сторони. Участь у медіації зазвичай є добровільною. Сторони мають довіряти медіатору та його здатності бути нейтральним і неупередженим."
  },
  {
    "word": "Ненасильницьке спілкування",
    "description": "Виражати себе таким чином, щоб не погрожувати, не залякувати і не завдавати шкоди іншим. Це спілкування з повагою, висловлюючи свої почуття і потреби щодо ситуації, не звинувачуючи і не перекладаючи провину на іншу людину. Це більше про відмову від насильства в нашому серці, яке зазвичай виражається в образливих, агресивних або звинувачувальних словах. Це реальна навичка, яку можна розвинути та опанувати з практикою."
  },
  {
    "word": "Агенти поведінкових змін",
    "description": "Молодь, яка прагне просувати культуру ненасилля та миру, а також пом'якшувати напруженість та запобігати її переростанню в насильство. Для них життєво важливо бути прикладом для наслідування."
  },
  {
    "word": "Почуття та потреби",
    "description": "Емоції та необхідності/потреби, які ми висловлюємо щодо ситуації, не звинувачуючи іншу людину. Важливо визначити, що людина відчуває і які її незадоволені потреби."
  },
  {
    "word": "Відсторонений і рефлексивний спосіб",
    "description": "Метод спілкування, при якому ми можемо \"охолонути\" та дистанціюватися від своїх емоцій, щоб краще побачити об'єктивні факти, а не інтерпретації чи судження."
  },
  {
    "word": "Самовираження",
    "description": "Невід'ємна потреба людини, яку необхідно задовольнити для участі у плідному діалозі та пошуку ефективного і життєздатного вирішення ситуації чи проблеми. Насильство часто є відчайдушним криком про увагу до непочутої або незадоволеної потреби."
  },
  {
    "word": "Об'єктивна реальність",
    "description": "Ясне бачення того, що відбулося насправді, після того, як ми заспокоїлися і змогли чіткіше бачити ситуацію."
  },
  {
    "word": "Дискримінація",
    "description": "Різне ставлення до людей, які мають однакові потреби або можливості, на основі таких критеріїв, як стать, вік, соціальний статус, релігія, етнічне походження, інвалідність, національність, ВІЛ-статус, колір шкіри, сексуальна орієнтація, політична приналежність тощо. Це може бути, наприклад, відмова у доступі до школи, роботи чи житла. Вона є наслідком відсутності критичного мислення та неосвіченості, що призводить до страху перед \"іншим\"."
  },
  {
    "word": "Недопущення дискримінації",
    "description": "Полягає в однаковому ставленні до людей, які перебувають в однаковому становищі з точки зору потреб або вразливості, незалежно від їхньої релігії, етнічної приналежності, політичних поглядів, соціального класу, статі чи інших критеріїв."
  },
  {
    "word": "Повага до різноманіття",
    "description": "Не лише визнання того, що інші можуть відрізнятися (наприклад, політичною приналежністю), але й повага до цієї відмінності. Означає вітати всіх людей і активно шукати участь і цінність кожного, не створюючи перешкод для участі через вік, національність, сексуальну орієнтацію, інвалідність тощо."
  },
  {
    "word": "Стигматизація",
    "description": "Вказівка на відмінності як на щось \"погане\", що часто призводить до дискримінаційної поведінки. Наприклад, коли над школярем, який страждає на ожиріння або дислексію, сміються однолітки."
  },
  {
    "word": "Нетерпимість",
    "description": "Ставлення до неприйняття відмінностей, яке може бути викликане, наприклад, кліше або стереотипами. Може швидко призвести до насильства."
  },
  {
    "word": "Міжкультурний діалог",
    "description": "Процес відкритого і конструктивного обміну або взаємодії між окремими особами, групами і народами, зокрема з людьми іншого культурного, етнічного, релігійного і мовного походження, які бачать світ не так, як ми. Його метою є розуміння, розширення участі, сприяння рівності та гармонійній взаємодії."
  },
  {
    "word": "Різноманіття",
    "description": "Безліч розбіжностей у думках, концепціях, цінностях, що існують як всередині, так і між культурами. Розуміння та вивчення різноманітних поглядів і практик є метою міжкультурного діалогу."
  },
  {
    "word": "Бар'єри між культурами",
    "description": "Причини недовіри та напруги, що можуть призвести до дискримінації і навіть насильства, які міжкультурний діалог заохочує виявляти, ставити під сумнів та долати."
  },
  {
    "word": "Критичне мислення",
    "description": "Процес нейтрального та неупередженого мислення. Це навичка, завдяки якій ми використовуємо наші знання та інтелект, щоб досягти найбільш об'єктивної та обґрунтованої позиції щодо певного питання. Це здатність мислити чітко, раціонально, об'єктивно і нейтрально, ставлячи під сумнів будь-яку \"дану\" інформацію."
  },
  {
    "word": "Упередження",
    "description": "Надання переваги комусь або чомусь або упередження проти когось або чогось. Воно не є об'єктивним і часто вважається несправедливим, призводить до однобічного або часткового бачення. Існують різні форми: особисті, культурні, упередження засобів масової інформації."
  },
  {
    "word": "Судження",
    "description": "Жорстка й однозначна позиція щодо людей чи речей як \"хороших\" чи \"поганих\", \"правильних\" чи \"неправильних\". Означає постійну оцінку або засудження інших за іншу думку або спосіб життя."
  },
  {
    "word": "Відмова від упереджень",
    "description": "Відпустити уподобання чи упередження, щоб ми могли бути об'єктивними та нейтральними. Це важливий крок у процесі критичного мислення."
  },
  {
    "word": "Неосудження",
    "description": "Означає, що ми не навішуємо ярликів, не класифікуємо щось і не реагуємо на це через призму \"правильного\" чи \"неправильного\", \"доброго\" чи \"поганого\". Сприяє довірі і є \"відкривачем дверей\"."
  },
  {
    "word": "Об'єктивність",
    "description": "Риса, якої прагне критичне мислення, що дозволяє бачити \"повну картину\" та аналізувати докази раціонально і неупереджено."
  },
  {
    "word": "Емпатія",
    "description": "Це здатність ставити себе на місце іншої людини. Це означає, що ми розуміємо і відчуваємо почуття іншої людини, а також можемо, хоча б тимчасово, перейнятися її переживаннями."
  },
  {
    "word": "Жалість",
    "description": "Це співчуття до когось. Якщо ми когось жаліємо, ми так чи інакше порівнюємо себе з цією людиною і, як правило, почуваємося краще, ніж той, кого ми жаліємо. 'О, бідолаха!' - типовий спосіб вираження жалю."
  },
  {
    "word": "Співчуття",
    "description": "Це коли ми відчуваємо страждання того, хто страждає, так, ніби ми самі страждаємо."
  },
  {
    "word": "Гендер",
    "description": "Це поняття, що позначає певні соціальні відмінності між жінками та чоловіками. Ґендер - це не лише 'жіночі питання'. На ґендер впливають соціальні та культурні фактори, і тому він змінюється в різних контекстах і з часом. В той час як стать - це просто біологічні та фізіологічні відмінності."
  },
  {
    "word": "Гендерна нерівність",
    "description": "Нерівність між чоловіками та жінками існує в усіх країнах і набуває різних форм: від вбивства маленьких дівчаток при народженні... до того, що чоловіки отримують вищу заробітну плату, ніж жінки, за виконання однакової роботи."
  },
  {
    "word": "Гендерна рівність",
    "description": "Не означає, що жінки та чоловіки однакові. Це означає, що їхні права, обов'язки та можливості не залежать від статі."
  },
  {
    "word": "Внутрішня гармонія",
    "description": "Це стан фізичного, ментального та духовного спокою. Це стан рівноваги (і, виходячи з цього стану, чіткого самоусвідомлення), в якому досягається стабільність і який приносить душевний і внутрішній спокій."
  },
  {
    "word": "Баланс",
    "description": "Це стан, вільний від напруги, який виникає завдяки прислуханню до внутрішнього голосу та позиції 'недіяння'. Це розслаблений і спокійний стан усвідомленості, який виникає тому, що ми дозволяємо йому відбуватися."
  },
  {
    "word": "Стабілізація в рівновазі",
    "description": "Це процес навчання пізнання, розуміння і постійної роботи над собою. Це призводить до смирення і чесності по відношенню до себе, інших і навколишнього середовища."
  },
  {
    "word": "Вирівнювання (розслаблення)",
    "description": "Правильна постава, включаючи здатність внутрішнього слухання для посилення гнучкості та адаптивності. Ми можемо практикувати це, переміщуючи нашу свідомість у будь-яку частину тіла, щоб оптимізувати зв'язок між розумом і тілом та вирівняти нашу свідомість з навколишнім середовищем."
  },
  {
    "word": "Поміркованість (центрування)",
    "description": "Здатність свідомо культивувати баланс і стабільний центр на фізичному, емоційному та ментальному рівнях. Ми можемо практикувати це, збираючи, стабілізуючи і спрямовуючи енергію таким чином, щоб відповідно зняти напругу, заспокоїти розум і зміцнити силу волі."
  },
  {
    "word": "Смиренність (плинність)",
    "description": "Здатність бути неупередженим і терплячим. Ми можемо практикувати це через ефективний тайм-менеджмент або приділення повної уваги теперішньому моменту. Це дозволить нам зробити крок назад і поспостерігати за нашими позитивними і негативними тенденціями, що є ключовим етапом на шляху до внутрішніх змін. Кінцевою метою буде досягнення стану \"бути\", а не стану \"робити\", що посилить нашу силу вибору."
  },
  {
    "word": "Зусилля (зосередження)",
    "description": "Здатність знаходити ясність у тому, як ми функціонуємо, ставити чіткі цілі (серед яких - постійне самовдосконалення) і зосереджуватися на їх досягненні"
  },
  {
    "word": "Вдячність (розширююча і відновлююча)",
    "description": "Здатність усвідомлювати і визнавати безмежний взаємозв'язок усіх і всього. Ми можемо практикувати це, розмірковуючи над розумінням того, що наш прогрес відбувається не лише завдяки нашим власним зусиллям, але й завдяки поєднанню синхронізованих подій (що відбуваються одночасно), які принесли необхідну енергію для досягнення нашої мети. Таким чином, це дає нам можливість бути вдячними людям, які сприяють нашому добробуту, оточуючим, природі та матері-землі."
  },
  {
    "word": "Активне слухання",
    "description": "Означає бути присутнім поруч зі співрозмовником. Це слухання того, що говорить співрозмовник, а також того, як і чому він це говорить. Це слухання для того, щоб переконатися, що ми правильно розуміємо справжнє значення слів або те, що ці слова означають для мовця. Також означає слухати 'нейтрально', не покладаючись на власні упереджені ідеї, упередження чи 'фільтри', створені нашою культурою, освітою чи вихованням."
  },
  {
    "word": "Уточнюючі запитання",
    "description": "Суть полягає в тому, щоб отримати \"повнішу\" картину або деталі, які стоять за ярликами чи розпливчастими поняттями. Наприклад, якщо мовець каже: \"Те, як моя подруга розмовляла зі мною, мене дуже розлютило; вона божевільна\", слухач може поставити уточнююче запитання на кшталт: \"Що саме вас розлютило?\": \"Що саме зробила ваша подруга, що вас розлютило?\"."
  },
  {
    "word": "Перефразовування",
    "description": "Повторювати почуте, використовуючи власні слова, відмінні від слів співрозмовника, і зосереджуючись, зокрема, на їхньому значенні. Дає змогу співрозмовнику знати, що його справді чують і розуміють, що, зрештою, і є головною метою. Наприклад: \"Ти кажеш, що твоя подруга підвищила голос і кинула в тебе м'ячем, і ти засмутився..., так?\""
  }
]
