[
  {
    "word": "Соціальна ізоляція",
    "description": "Людина або навіть невелика група більше не є активною частиною \"основного\" суспільства; вони живуть на узбіччі суспільства\".\n\"<br>У кожній громаді є групи людей - часто приховані - які не можуть користуватися загальними благами, доступними для \"основного\" суспільства... Коли хтось є частиною суспільства, між ним і цим суспільством існує зв'язок. У випадку соціальної ізоляції цей зв'язок розривається.\n"
  },
  {
    "word": "Вразливі групи",
    "description": "До таких вразливих груп можуть належати: жінки та дівчата, люди похилого віку, люди, які живуть з ВІЛ/СНІДом або мають інвалідність, люди конкретної (\"нетрадиційної\") сексуальної орієнтації та представники меншин. Вразливі групи дуже вразливі до дискримінації, відчуження та насильства."
  },
  {
    "word": "Соціальна інклюзія",
    "description": "На противагу соціальній ізоляції існує соціальна інклюзія - процес, спрямований на зміцнення зв'язку людей зі своїм суспільством та його членами, а особливо на відновлення цього зв'язку, коли він ослаблений або розірваний."
  },
  {
    "word": "Розмаїття",
    "description": "На індивідуальному рівні, як агенти змін у поведінці, ми маємо унікальну можливість подавати приклад, бути чутливими до потреб інших, незалежно від того, чи є вони частиною \"основного\" суспільства, чи меншиною, а також бути лідерами у просуванні інклюзії ізольованих груп."
  },
  {
    "word": "Економічна ізоляція",
    "description": "Люди, які не мають достатньо коштів для задоволення потреб, що вважаються \"нормальними\" в суспільстві)"
  },
  {
    "word": "Правова ізоляція",
    "description": "Приклад: люди, такі як мігранти, які не мають правового статусу"
  },
  {
    "word": "Фізична ізоляція",
    "description": "Приклад: люди з обмеженими можливостями , які фізично не можуть брати участь у житті \"основного\" суспільства."
  },
  {
    "word": "Інституційна ізоляція",
    "description": "Приклад: люди, які перебувають у в'язниці або таборах для біженців."
  },
  {
    "word": "Насилля",
    "description": "Застосування сили або влади, у вигляді дії, або бездіяльності в будь-якій обстановці, погрози, уявної, або реальної по відношенню до себе, іншої особи, групи, спільноти, що призводить або з великою ймовірністю може призвести до смерті, фізичної травми, психологічної або емоційної шкоди, відставання в розвитку або позбавлення прав."
  },
  {
    "word": "Самоспрямоване насильство",
    "description": "Насильство над собою, включаючи самогубство та зловживання психоактивними речовинами або зловживання наркотиками."
  },
  {
    "word": "Міжособистісне насильство",
    "description": "Насильство, що відбувається між людьми, які можуть бути або не бути знайомі один з одним, включаючи жорстоке поводження з дітьми, знущання, домашнє або сімейне насильство, насильство над людьми похилого віку, а також (на рівні громади) бандитське насильство , насильство з боку вболівальників спортивних команд, напади натовпу, насильство над маргіналізованими групами і т.д."
  },
  {
    "word": "Колективне насильство",
    "description": "Насильство під час війни, тероризму, геноциду тощо."
  },
  {
    "word": "Попередження насильства",
    "description": "Означає уникнення насильства в першу чергу."
  },
  {
    "word": "Пом'якшення наслідків насильства",
    "description": "Зосереджується на зниженні подальшого ризику насильства та зменшенні його наслідків, коли воно вже сталося."
  }
]
